<template><h1 id="ps快速抠出头像" tabindex="-1"><a class="header-anchor" href="#ps快速抠出头像" aria-hidden="true">#</a> ps快速抠出头像</h1>
<h3 id="如何快速抠出头像更换背景-处理头发后面的背景颜色" tabindex="-1"><a class="header-anchor" href="#如何快速抠出头像更换背景-处理头发后面的背景颜色" aria-hidden="true">#</a> 如何快速抠出头像更换背景-处理头发后面的背景颜色</h3>
<ul>
<li>1、打开素材图片，首先点击快速蒙版。</li>
<li>2、然后按“B”对着图片点击右键选择笔头（画笔选择不透明度：100%，流量：100%）。</li>
<li>3、然后用笔刷将有头发的区域涂完</li>
<li>4、涂完后再点击一下那个“快速蒙版”就会出现选区。然后按快捷键Ctrl + Shift + i 反选，再按快捷键“M”（M是选框工具，当然也可以按“L”）。然后按鼠标右键，在弹出的菜单选择“调整边缘”。</li>
<li>5、修改弹出的设置：视图选择：“黑底” 输出到选择：“新建带有图层的蒙版图层”。然后顺便点击“记住设置”。</li>
<li>6、然后左边的调整半径工具按钮，鼠标就会变成像画笔一样，然后用该画笔涂抹头发后面的背景颜色,涂抹过程中头发后面的背景色会逐渐消失。
<img :src="$withBase('/psb.png')" alt="dock"></li>
<li>7、涂完后点击确定，就会出现一个新建蒙版了。新建白色背景图层放上白色底看效果</li>
<li>8、然后把下面的图层都隐藏掉，只留下那个图层1副本（就是空白背景的图层，也就是你刚刚抠出来的那个图），在最上面新建一个空白图层，按Ctrl + Alt + Shift + E 就会出现一张没蒙版的抠好图的图层。</li>
<li>9、后面可根据需要自行调整画面。</li>
<li><a href="http://www.ps-xxw.cn/tupianchuli/9331.html" target="view_window">原文链接</a></li>
</ul>
</template>
